app/Controllers/usuario_controller.php

INSERT INTO `usuarios` (`nombre`, `apellido`, `usuario`, `email`, `pass`) VALUES ('Maria', 'gomez', 'maria', 'maria2@gmail.com', '$2y$10$OU6rmX3whhgdC5k/CUKlzOPE7S3PHktmf4lQ29Za2T7ZKsa1lGsXK')
---
        	echo view('front/footer_view');

		}else{
			$formModel->save([
				'nombre'=> $this->request->getVar('nombre'),
				'apellido'=> $this->request->getVar('apellido'),
				'usuario'=> $this->request->getVar('usuario'),
				'email'=> $this->request->getVar('email'),
				'pass'=> password_hash($this->request->getVar('pass'), PASSWORD_DEFAULT),


			]);